app/controllers/adminpanel_controller.rb

  def requests
    @requests = Request.all
---
SELECT "requests".* FROM "requests"

  def users
    @users = User.all
---
SELECT "users".* FROM "users"

  def checked
    @requests = Request.all
---
SELECT "requests".* FROM "requests"