LegalCompany/app/controllers/requests_controller.rb

SELECT "requests".* FROM "requests"
---
  def old_applications
    @requests = Request.all