LegalCompany/app/controllers/requests_controller.rb

  def create
    # @request = Request.new(request_params)
    @request = current_user.requests.build(request_params)

    respond_to do |format|
      if @request.save
---
INSERT INTO "requests" ("first_name", "last_name", "email", "phone", "description", "created_at", "updated_at", "user_id", "reaction") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @request.update(request_params)
---
UPDATE "requests" SET "first_name" = ?, "updated_at" = ? WHERE "requests"."id" = ?  [["first_name", "andrey.almashi47@gmail.com"], ["updated_at", "2023-04-15 14:12:07.499534"], ["id", 13]]

  def destroy
    @request.destroy
---
DELETE FROM "requests" WHERE "requests"."id" = ?  [["id", 10]]

  def correct_user
    @request = current_user.requests.find_by(id: params[:id])
---
SELECT "requests".* FROM "requests" WHERE "requests"."user_id" = ? AND "requests"."id" = ? LIMIT ?  [["user_id", 3], ["id", 10], ["LIMIT", 1]]