LegalCompany/app/controllers/statements_controller.rb

SELECT "statements".* FROM "statements"
---
  def index
    @statements = Statement.all

SELECT "statements".* FROM "statements" WHERE "statements"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @statement = Statement.find(params[:id])